In [29]:
import pandas as pd
from pandas import Series,DataFrame

data1 = ([1,2,3], [4,5,6], [7,8,9])

df1 =pd.DataFrame(data1, index=['A','B','C'], columns=['D','E','F'])

S1= pd.Series([1,2,3],
              ['A','B','C'], name='G')
print(df1)
print()
print(S1)
df2 = [df1, S1]
df2 = pd.concat(df2, axis= 1)
df2

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

A    1
B    2
C    3
Name: G, dtype: int64

   D  E  F  G
A  1  2  3  1
B  4  5  6  2
C  7  8  9  3

In [32]:
import pandas as pd
from pandas import Series,DataFrame

df1 = pd.DataFrame({ 'key' : [1,2,3],
                     'value' : ['A','B','C']})

df2 = pd.DataFrame({ 'id' : [1,2,3],
                     'category' : ['X','Y','Z']})

print(df1)
print(df2)

df3 = pd.merge(df1, df2, left_on="key", right_on="id")
df3

   key value
0    1     A
1    2     B
2    3     C
   id category
0   1        X
1   2        Y
2   3        Z

   key value  id category
0    1     A   1        X
1    2     B   2        Y
2    3     C   3        Z

In [56]:
import pandas as pd
from pandas import Series,DataFrame

data = [1,2,3,4,60,70,80,51]
s1 = pd.Series(data)

def pr(x) :
    if 50 <= x :
        return print(x)
s1.apply(pr)

60
70
80
51

0    None
1    None
2    None
3    None
4    None
5    None
6    None
7    None
dtype: object

In [63]:
import pandas as pd
from pandas import Series,DataFrame

df1 = pd.DataFrame({ 'name' : ['John','Alice', 'Bob'],
                     'age' : [30,25,35],
                     'city' : ['New York','Los Angeles', 'Chicago']})
                    
df1.to_json("examples/test13.json")
df_read = pd.read_json("examples/test13.json")
df_read

    name  age         city
0   John   30     New York
1  Alice   25  Los Angeles
2    Bob   35      Chicago

In [62]:
import pandas as pd
from pandas import Series,DataFrame

df1 = pd.DataFrame({ 'customer_id' : [1,2,3,4,4],
                     'customer_name' : ['경수','철수','영수','강수','강수']})
df2 = pd.DataFrame({ 'customer_id' : [1,2,3,4],
                     'order_id' : [101,102,103,104]})              

df3 = pd.merge(df1, df2)
df3

   customer_id customer_name  order_id
0            1            경수       101
1            2            철수       102
2            3            영수       103
3            4            강수       104
4            4            강수       104